* lfedn unit tests
  :PROPERTIES:
  :tangle:   test/unit-lfedn-tests.lfe
  :session:  lfedn-unit-tests
  :END:
#+BEGIN_SRC lfe
(defmodule unit-lfedn-tests
  (behaviour ltest-unit)
  (export all))

(include-lib "ltest/include/ltest-macros.lfe")
#+END_SRC

#+BEGIN_SRC lfe
(deftest char->string () (check '#(char #\$) "\\$"))

(deftest nil-keyword->string () (check '#(keyword nil) ":nil"))

(deftest keyword->string () (check 'foo ":foo"))

(deftest true->string () (check 'true "true"))

(deftest false->string () (check 'false "false"))

(deftest nil->string () (check 'nil "nil"))

(deftest integer->string () (check 42 "42"))

(deftest float->string () (check 42.4 "42.4"))

(deftest string->string () (check #"hello" "\"hello\""))

(deftest string-with-escapes->string () (check #"h\n\r\"\\ello"
                                               "\"h\\n\\r\\\"\\\\ello\""))

(deftest symbol->string () (check '#(symbol foo) "foo"))

(deftest tagged-value->string () (check '#(tag foo 42) "#foo 42"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest empty-vector->string () (check '#(vector []) "[]"))

(deftest empty-list->string () (check '() "()"))

(deftest empty-set->string () (check '#(set []) "#{}"))

(deftest empty-map->string () (check '#(map []) "{}"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest singleton-map->string () (check '#(map [#(true 1)]) "{true 1}"))

(deftest singleton-vector->string () (check '#(vector [1]) "[1]"))

(deftest singleton-list->string () (check '[1] "(1)"))

(deftest singleton-set->string () (check '#(set [1]) "#{1}"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest vector->string () (check '#(vector [1 foo]) "[1 :foo]"))

(deftest list->string () (check '[1 foo nil] "(1 :foo nil)"))

(deftest set->string () (check '#(set [1 foo nil]) "#{1 :foo nil}"))

(deftest map->string () (check '#(map [#(1 foo) #(2 bar) #(3 nil)])
                               "{1 :foo 2 :bar 3 nil}"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest vector3->string () (check '#(vector [1 foo nil]) "[1 :foo nil]"))

(deftest list3->string () (check '[1 foo nil] "(1 :foo nil)"))

(deftest set3->string () (check '#(set [1 foo nil]) "#{1 :foo nil}"))

(deftest map3->string () (check '#(map [#(1 foo) #(2 bar) #(3 nil)])
                                "{1 :foo 2 :bar 3 nil}"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest char->lfe () (ctl '#(char #\a) #"a"))

(deftest integer->lfe () (ctl 41 41))

(deftest float->lfe () (ctl 41.2 41.2))

(deftest keyword->lfe () (ctl 'foo 'foo))

(deftest nil->lfe () (ctl 'nil 'nil))

(deftest true->lfe () (ctl 'true 'true))

(deftest false->lfe () (ctl 'false 'false))

(deftest string->lfe () (ctl #"asd" #"asd"))
#+END_SRC

#+BEGIN_SRC lfe
(deftest list->lfe () (ctl '[] '[]))

(deftest list1->lfe () (ctl '[1] '[1]))

(deftest list2->lfe () (ctl '[1 foo] '[1 foo]))

(deftest list-nested->lfe () (ctl '[1 #(char #\a)] '[1 #"a"]))
#+END_SRC

#+BEGIN_SRC lfe
(deftest vector->lfe () (ctl '#(vector []) '[]))

(deftest vector1->lfe ()(ctl '#(vector [1]) '[1]))

(deftest vector2->lfe () (ctl '#(vector [1 foo]) '[1 foo]))

(deftest vector-nested->lfe () (ctl '#(vector [1 #(char #\a)]) '[1 #"a"]))
#+END_SRC

#+BEGIN_SRC lfe
(deftest set-nested->lfe () (ctl '#(set [1 #(char #\a) 1]) '[1 #"a"]
                                 #'sets:to_list/1))

(deftest map->lfe () (ctl '#(map [#(1 #(char #\a))]) '[#(1 #"a")]
                          #'maps:to_list/1))

(deftest nil-keyword->lfe () (ctl '#(keyword nil) 'nil))

(deftest symbol->lfe () (ctl '#(symbol foo) '#(symbol foo)))
#+END_SRC

#+BEGIN_SRC lfe
(deftest tag->lfe ()
  (let ((result (lfedn:to-lfe '#(tag foo 42)
                              `[#(foo ,(lambda (_ val _) (+ 1 val)))])))
    (is-equal 43 result)))

(deftest unknown-tag-raises-in-to-lfe ()
  (try
      (progn (lfedn:to-lfe '#(tag bar 42)
                           `[#(foo ,(lambda (_ val _) (+ val 1)))])
             (throw 'should-fail))
    (catch (`#(,_ #(handler-not-found-for-tag bar) ,_) 'ok))))
#+END_SRC

Internal functions:
#+BEGIN_SRC lfe
(defun check (val str)
  (let ((result (lists:flatten (lfedn:to-string val))))
    (is-equal str result)))

(defun ctl (val expected)
  (let ((result (lfedn:to-lfe val)))
    (is-equal expected result)))

(defun ctl (val expected transformer)
  (let ((result (funcall transformer (lfedn:to-lfe val))))
    (is-equal expected result)))
#+END_SRC

#+NAME: run-tests
#+BEGIN_SRC lfe :exports results :tangle no
(c "test/unit-lfedn-tests.lfe")
(eunit:test 'unit-lfedn-tests '[verbose])
#+END_SRC

#+RESULTS: run-tests
#+begin_example
> (eunit:test 'unit-lfedn-tests '[verbose])
======================== EUnit ========================
module 'unit-lfedn-tests'
  unit-lfedn-tests: unknown-tag-raises-in-to-lfe_test...ok
  unit-lfedn-tests: tag->lfe_test...ok
  unit-lfedn-tests: map->lfe_test...ok
  unit-lfedn-tests: nil-keyword->lfe_test...ok
  unit-lfedn-tests: symbol->lfe_test...ok
  unit-lfedn-tests: set-nested->lfe_test...ok
  unit-lfedn-tests: vector->lfe_test...ok
  unit-lfedn-tests: vector1->lfe_test...ok
  unit-lfedn-tests: vector2->lfe_test...ok
  unit-lfedn-tests: vector-nested->lfe_test...ok
  unit-lfedn-tests: list->lfe_test...ok
  unit-lfedn-tests: list1->lfe_test...ok
  unit-lfedn-tests: list2->lfe_test...ok
  unit-lfedn-tests: list-nested->lfe_test...ok
  unit-lfedn-tests: integer->lfe_test...ok
  unit-lfedn-tests: float->lfe_test...ok
  unit-lfedn-tests: keyword->lfe_test...ok
  unit-lfedn-tests: nil->lfe_test...ok
  unit-lfedn-tests: true->lfe_test...ok
  unit-lfedn-tests: false->lfe_test...ok
  unit-lfedn-tests: string->lfe_test...ok
  unit-lfedn-tests: char->lfe_test...ok
  unit-lfedn-tests: vector3->string_test...ok
  unit-lfedn-tests: list3->string_test...ok
  unit-lfedn-tests: set3->string_test...ok
  unit-lfedn-tests: map3->string_test...ok
  unit-lfedn-tests: list->string_test...ok
  unit-lfedn-tests: set->string_test...ok
  unit-lfedn-tests: map->string_test...ok
  unit-lfedn-tests: vector->string_test...ok
  unit-lfedn-tests: singleton-map->string_test...ok
  unit-lfedn-tests: singleton-vector->string_test...ok
  unit-lfedn-tests: singleton-list->string_test...ok
  unit-lfedn-tests: singleton-set->string_test...ok
  unit-lfedn-tests: char->string_test...ok
  unit-lfedn-tests: nil-keyword->string_test...ok
  unit-lfedn-tests: keyword->string_test...ok
  unit-lfedn-tests: true->string_test...ok
  unit-lfedn-tests: false->string_test...ok
  unit-lfedn-tests: nil->string_test...ok
  unit-lfedn-tests: integer->string_test...ok
  unit-lfedn-tests: float->string_test...ok
  unit-lfedn-tests: string->string_test...ok
  unit-lfedn-tests: string-with-escapes->string_test...ok
  unit-lfedn-tests: symbol->string_test...ok
  unit-lfedn-tests: tagged-value->string_test...ok
  unit-lfedn-tests: empty-vector->string_test...ok
  unit-lfedn-tests: empty-list->string_test...ok
  unit-lfedn-tests: empty-set->string_test...ok
  unit-lfedn-tests: empty-map->string_test...ok
  [done in 0.150 s]
=======================================================
  All 50 tests passed.
ok
#+end_example
